{"weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"shape": [5, 5, 1, 32], "dtype": "float32", "name": "conv2d_1/kernel"}, {"shape": [32], "dtype": "float32", "name": "conv2d_1/bias"}, {"shape": [5, 5, 32, 32], "dtype": "float32", "name": "conv2d_2/kernel"}, {"shape": [32], "dtype": "float32", "name": "conv2d_2/bias"}, {"shape": [3, 3, 32, 64], "dtype": "float32", "name": "conv2d_3/kernel"}, {"shape": [64], "dtype": "float32", "name": "conv2d_3/bias"}, {"shape": [3, 3, 64, 64], "dtype": "float32", "name": "conv2d_4/kernel"}, {"shape": [64], "dtype": "float32", "name": "conv2d_4/bias"}, {"shape": [3136, 256], "dtype": "float32", "name": "dense_1/kernel"}, {"shape": [256], "dtype": "float32", "name": "dense_1/bias"}, {"shape": [256, 10], "dtype": "float32", "name": "dense_2/kernel"}, {"shape": [10], "dtype": "float32", "name": "dense_2/bias"}]}], "modelTopology": {"model_config": {"config": [{"config": {"use_bias": true, "dilation_rate": [1, 1], "dtype": "float32", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform", "dtype": "float32"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "filters": 32, "bias_constraint": null, "strides": [1, 1], "activation": "relu", "bias_regularizer": null, "trainable": true, "batch_input_shape": [null, 28, 28, 1], "name": "conv2d_1", "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [5, 5], "padding": "same", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"use_bias": true, "dilation_rate": [1, 1], "dtype": "float32", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform", "dtype": "float32"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "filters": 32, "bias_constraint": null, "strides": [1, 1], "activation": "relu", "bias_regularizer": null, "trainable": true, "name": "conv2d_2", "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [5, 5], "padding": "same", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "dtype": "float32", "name": "max_pooling2d_1", "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "noise_shape": null, "dtype": "float32", "name": "dropout_1", "rate": 0.25, "seed": null}, "class_name": "Dropout"}, {"config": {"use_bias": true, "dilation_rate": [1, 1], "dtype": "float32", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform", "dtype": "float32"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "filters": 64, "bias_constraint": null, "strides": [1, 1], "activation": "relu", "bias_regularizer": null, "trainable": true, "name": "conv2d_3", "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"use_bias": true, "dilation_rate": [1, 1], "dtype": "float32", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform", "dtype": "float32"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "filters": 64, "bias_constraint": null, "strides": [1, 1], "activation": "relu", "bias_regularizer": null, "trainable": true, "name": "conv2d_4", "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "padding": "same", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "dtype": "float32", "name": "max_pooling2d_2", "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "noise_shape": null, "dtype": "float32", "name": "dropout_2", "rate": 0.25, "seed": null}, "class_name": "Dropout"}, {"config": {"trainable": true, "dtype": "float32", "name": "flatten_1", "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"use_bias": true, "dtype": "float32", "kernel_regularizer": null, "units": 256, "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "trainable": true, "name": "dense_1", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform", "dtype": "float32"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "noise_shape": null, "dtype": "float32", "name": "dropout_3", "rate": 0.5, "seed": null}, "class_name": "Dropout"}, {"config": {"use_bias": true, "dtype": "float32", "kernel_regularizer": null, "units": 10, "bias_constraint": null, "activation": "softmax", "bias_regularizer": null, "trainable": true, "name": "dense_2", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform", "dtype": "float32"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}, "training_config": {"optimizer_config": {"config": {"lr": 1.5625000742147677e-05, "epsilon": 1e-08, "rho": 0.8999999761581421, "decay": 0.0}, "class_name": "RMSprop"}, "loss": "categorical_crossentropy", "sample_weight_mode": null, "loss_weights": null, "metrics": ["accuracy"]}, "backend": "tensorflow", "keras_version": "2.1.6-tf"}}